<html xmlns:ng="http://docbook.org/docbook-ng"><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>PB138 - Z&aacute;vere&#269;n&aacute; zpr&aacute;va k projektu</title><meta name="generator" content="DocBook XSL Stylesheets V1.79.2"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="article"><div class="titlepage"><div><div><h1 class="title"><a name="d5e1"></a>PB138 - Z&aacute;vere&#269;n&aacute; zpr&aacute;va k projektu</h1></div><div><h3 class="subtitle"><i>Desktopov&aacute; aplikace pro spr&aacute;vu dom&aacute;c&iacute; videot&eacute;ky v Jav&#283;</i></h3></div><div><div class="author"><h3 class="author">Roman Gluszny</h3><code class="email">&lt;<a class="email" href="mailto:422473@mail.muni.cz">422473@mail.muni.cz</a>&gt;</code></div></div></div><hr></div><div class="toc"><p><b>Table of Contents</b></p><dl class="toc"><dt><span class="sect1"><a href="#d5e8">&Uacute;vod</a></span></dt><dt><span class="sect1"><a href="#d5e11">
            N&aacute;vrh u&#382;ivatelsk&eacute;ho rozhran&iacute;
        </a></span></dt><dt><span class="sect1"><a href="#d5e33">Zpracov&aacute;n&iacute; u&#382;ivatelsk&eacute;ho rozhran&iacute;</a></span></dt><dt><span class="sect1"><a href="#d5e40">Vytvo&#345;en&iacute; UML diagram&#367;</a></span></dt><dd><dl><dt><span class="sect2"><a href="#d5e48">Use-case diagram</a></span></dt><dt><span class="sect2"><a href="#d5e64">Class diagram</a></span></dt></dl></dd></dl></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e8"></a>&Uacute;vod</h2></div></div></div><p>
            Obsahem tohoto dokumentu je popis mnou odveden&eacute; pr&aacute;ce na semestr&aacute;ln&iacute;m projektu p&#345;edm&#283;tu PB138 - Modern&iacute; zna&#269;kovac&iacute; jazyky.
            T&eacute;matem na&#353;&iacute; pr&aacute;ce bylo vytvo&#345;en&iacute; desktopov&eacute; aplikace v programocac&iacute;m jazyce Java, kter&yacute; umo&#382;&#328;uje spr&aacute;vu dom&aacute;c&iacute; videot&eacute;ty
            prost&#345;ednictv&iacute;m souboru ve form&aacute;tu ODS.
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e11"></a>
            N&aacute;vrh u&#382;ivatelsk&eacute;ho rozhran&iacute;
        </h2></div></div></div><p> Zam&#283;&#345;il jsem se na okna obsahuj&iacute;c&iacute; formul&aacute;&#345;e pot&#345;ebn&eacute; pro jednotliv&eacute; funkce
            kartot&eacute;ky. N&aacute;vrh byl proveden pommoc&iacute; online n&aacute;stroje <span class="emphasis"><em>draw.io</em></span> na
            z&aacute;klad&#283; n&aacute;&#269;rtku kolegy Michala B&aacute;bela. Konkr&eacute;tn&#283; jde o formul&aacute;&#345;e pro vytvo&#345;en&iacute; nov&eacute;
            kategorie, vytvo&#345;en&iacute; a editaci m&eacute;dia a dialogov&eacute; okno pro p&#345;esun m&eacute;dia mezi kategoriemi.
            By&#357; bylo z d&#367;vodu implementa&#269;n&iacute;ch po&#382;adavk&#367; pot&#345;eba n&#283;kter&eacute; n&aacute;vrhy pozm&#283;nit, jejich
            charakter z&#367;stal zachov&aacute;n. </p><p>
            Okno pro vytvo&#345;en&iacute; nov&eacute; kategori se skl&aacute;d&aacute; z textov&eacute;ho pole pro jm&eacute;no kategorie 
            a seznamu polo&#382;ek, kter&eacute; kategotie obsahuje.
            </p><div class="figure"><a name="d5e16"></a><p class="title"><b>Figure&nbsp;1.&nbsp;Create category</b></p><div class="figure-contents"><div class="mediaobject"><img src="../../png/create-category-window.png" alt="Create category"></div></div></div><p><br class="figure-break">
        </p><p>
            Okno pro vytvo&#345;en&iacute; nov&eacute;ho media bylo navr&#382;eno podobn&#283; jako formul&aacute;&#345; pro pr&aacute;ci s kategori&iacute;, av&#353;ak 
            program&aacute;tor tento koncept pozm&#283;nil, aby mohl slou&#382;it stejn&eacute;mu &uacute;&#269;elu i v p&#345;&iacute;pad&#283; editace ji&#382; existuj&iacute;c&iacute;ho m&eacute;dia.
            </p><div class="figure"><a name="d5e22"></a><p class="title"><b>Figure&nbsp;2.&nbsp;Create medium</b></p><div class="figure-contents"><div class="mediaobject"><img src="../../png/create-medium-window.png" alt="Create medium"></div></div></div><p><br class="figure-break">
        </p><p>
            Dialogov&eacute; okno pro p&#345;esun m&eacute;dia mezi kategoriemi slo&#382;&iacute; pro zobrazen&iacute; proveden&yacute;ch zm&#283;n v&#269;etn&#283; p&#345;ejmenov&aacute;n&iacute; sloupc&#367;. 
            U&#382;ivatel je upozorn&#283;n, &#382;e p&#345;i p&#345;esunu m&#367;&#382;e doj&iacute;t ke ztr&aacute;t&#283; dat a je dot&aacute;z&aacute;n, zda si zm&#283;nu skute&#269;n&#283; p&#345;eje.
            </p><div class="figure"><a name="d5e28"></a><p class="title"><b>Figure&nbsp;3.&nbsp;Move medium</b></p><div class="figure-contents"><div class="mediaobject"><img src="../../png/move-media-window.png" alt="Move medium"></div></div></div><p><br class="figure-break">
        </p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e33"></a>Zpracov&aacute;n&iacute; u&#382;ivatelsk&eacute;ho rozhran&iacute;</h2></div></div></div><p> Tvorba jednotliv&yacute;ch prvk&#367; u&#382;ivatelsk&eacute;ho rozhran&iacute; prob&iacute;hala v programu Scene Builder,
            samotn&aacute; implementace frontendu pak v IDE InteliJ Idea za pomoc&iacute; platformy JavaFX. Kdy&#382;
            u&#382;ivatel v hlavn&iacute;m menu kline na tla&#269;&iacute;tko <span class="emphasis"><em>Create category</em></span>, t&#345;&iacute;da
            zodpov&#283;dn&aacute; za navigaci v tomto menu vytvo&#345;&iacute; dialogovou t&#345;&iacute;du
                <span class="emphasis"><em>CategoryDialog</em></span>. Zde na&#269;te FXMLLoader formul&aacute;&#345; vytvo&#345;en&yacute; ve
            Scene Builderu ze kter&eacute;ho si tak&eacute; vyt&aacute;hne v&#353;echny pot&#345;ebn&eacute; elementy.</p><p>Validn&iacute; kategorie mus&iacute; obsahovat jm&eacute;no, konkretn&#283; textov&yacute; &#345;et&#283;zec bez b&iacute;l&yacute;ch znak&#367;, a
            alespo&#328; jeden sloupec. Jestli&#382;e nejsou v&#353;echny tyto podm&iacute;nky spln&#283;ny, objev&iacute; se okno s
            po&#382;adavky a kategorie nebude vytvo&#345;ena. Nov&#283; vytvo&#345;en&aacute; kategorie z&iacute;sk&aacute; ID v z&aacute;visloti na
            po&#269;tu ji&#382; existuj&iacute;ch kategori&iacute;.</p><p>Pro vlo&#382;en&iacute; nov&eacute;ho sloupce sta&#269;&iacute; vyplnit textov&eacute; pole pod seznamem a kliknout na
            tla&#269;&iacute;tko se znakem plus. Horn&iacute; po&#269;et sloupc&#367; nen&iacute; nijak omezen. Jestli&#382;e si u&#382;ivatel
            p&#345;eje polo&#382;ku smazat, sta&#269;&iacute; na ji v seznamu ozna&#269;it lev&yacute;m klinut&iacute; s zm&aacute;&#269;knout kl&aacute;vesu
            delete. Vyvol&aacute;n&iacute; t&eacute;to ud&aacute;slosti zp&#367;sob&iacute; odstran&#283;n&iacute; sloupce ze seznamu.</p></div><div class="sect1"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e40"></a>Vytvo&#345;en&iacute; UML diagram&#367;</h2></div></div></div><p> Pro pot&#345;eby projektu byly vytvo&#345;eny dva UML diagramy, popisuj&iacute;c&iacute; po&#382;adavky a
            fungov&aacute;n&iacute; aplikace. Jsou to: </p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>Use-case diagram</p></li><li class="listitem"><p>Class diagram</p></li></ul></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e48"></a>Use-case diagram</h3></div></div></div><p> Diagram p&#345;&iacute;padu u&#382;it&iacute; p&#345;&iacute;mo vych&aacute;z&iacute; ze zad&aacute;n&iacute;. Jedin&yacute;m akt&eacute;rem v syst&eacute;mu je
                samotn&yacute; u&#382;ivatel, kter&yacute; d&aacute;le manipuluje s polo&#382;kami ve videot&eacute;ce. U&#382;ivatel m&#367;&#382;e
                prov&aacute;d&#283;t n&aacute;sleduj&iacute;c&iacute; operace: </p><div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem"><p>P&#345;id&aacute;n&iacute;/odebr&aacute;n&iacute; m&eacute;dia do/z videot&eacute;ky</p></li><li class="listitem"><p>Editace existuj&iacute;c&iacute;ho m&eacute;dia</p></li><li class="listitem"><p>Vyhled&aacute;n&iacute; m&eacute;dia podle filmu (nebo jin&eacute; polo&#382;ky m&eacute;dia)</p></li><li class="listitem"><p>P&#345;id&aacute;n&iacute;/odebr&aacute;n&iacute; kategorie do/z videot&eacute;ky</p></li><li class="listitem"><p>V&yacute;pis m&eacute;di&iacute; v dan&eacute; kategori v&#269;etn&#283; polo&#382;ek, kter&eacute; jsou na nich
                            obsa&#382;eny</p></li><li class="listitem"><p>P&#345;esun m&eacute;dia do jin&eacute; kategorie</p></li></ul></div></div><div class="sect2"><div class="titlepage"><div><div><h3 class="title"><a name="d5e64"></a>Class diagram</h3></div></div></div><p> Diagram t&#345;&iacute;d obsahuje v&#353;echny t&#345;&iacute;dy definovan&eacute; a dokumentovan&eacute; v ran&eacute; f&aacute;zi
                projektu. P&#345;i implemetaci v&#353;ak vyplunulo na povrch n&#283;kolik nesrovnalost&iacute; a pozd&#283;ji
                tak bylo pot&#345;eba diagram p&#345;epracovat, aby odpov&iacute;dal skute&#269;n&eacute; struktu&#345;e programu.
                P&#345;&iacute;kladem m&#367;&#382;e b&yacute;t &uacute;pln&eacute; odstran&#283;n&iacute; t&#345;&iacute;dy ColumnDTO, nebo v&yacute;voj&aacute;&#345;i shledali, &#382;e pole
                typu string je pro uchov&aacute;v&aacute;n&iacute; hodnot zcela posta&#269;uj&iacute;c&iacute;.</p></div></div></div></body></html>